---
title: AnalysisDisplayDiagramSettings
classe: Autodesk.Revit.DB.Analysis.AnalysisDisplayDiagramSettings
namespace: Autodesk.Revit.DB.Analysis
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 10
---

# AnalysisDisplayDiagramSettings

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `AnalysisDisplayStyleDiagramFenceType FenceType { get; set; }` | `analysisDisplayDiagramSettings.FenceType` | AnalysisDisplayStyleDiagramFenceType |
| `Boolean IsValidObject { get; }` | `analysisDisplayDiagramSettings.IsValidObject` | Boolean |
| `Color OutlineColor { get; set; }` | `analysisDisplayDiagramSettings.OutlineColor` | Color |
| `Int32 OutlineLineWeight { get; set; }` | `analysisDisplayDiagramSettings.OutlineLineWeight` | Int32 |
| `Double Rounding { get; set; }` | `analysisDisplayDiagramSettings.Rounding` | Double |
| `AnalysisDisplayStyleDiagramTextLabelType TextLabelType { get; set; }` | `analysisDisplayDiagramSettings.TextLabelType` | AnalysisDisplayStyleDiagramTextLabelType |
| `ElementId TextTypeId { get; set; }` | `analysisDisplayDiagramSettings.TextTypeId` | ElementId |
| `Int32 Transparency { get; set; }` | `analysisDisplayDiagramSettings.Transparency` | Int32 |
| `Void Dispose()` | `analysisDisplayDiagramSettings.Dispose()` | Void |
| `Boolean IsEqual(AnalysisDisplayDiagramSettings)` | `analysisDisplayDiagramSettings.IsEqual(other)` | Boolean |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```